package hometask04;

public class task1 {
    public static void main(String[] args) {

        // Задача на FOR
        // Вывести на экран первые 10 элементов последовательности 2 4 6 8 10 и тд
        for (int i = 2; i <= 20; i++ ){
            if (i % 2 == 0){
                System.out.print(i + " ");
            }
        }


    }
}
